package com.firecode.hadooptest.hbase.helloword;

/**
 * 需求：组织架构，部门-子部门
 * 1，查询等级部门
 * 2，查询每个部门的子部门
 * 3，部门添加删除
 * 4，部门添加删除子部门
 * 
 * 设计思路：一张表
 * 
 * 组织架构表：
 * --------------------------------------------------------------------------------------
 * dept(表)                         cf1(部门信息列族)                       cf2(子部门信息列族)
 * rowKey(部门等级_部门ID)=0_001     cf1:name=集团总部                                                             cf2:1_002=华北大区;cf2:1_003=华南大区
 * rowKey(部门等级_部门ID)=1_002     cf1:name=华北大区;cf1:parentId=0_001    cf2:2_004=天津办事处
 * rowKey(部门等级_部门ID)=1_003     cf1:name=华南大区;cf1:parentId=0_001    cf2:2_005=广东办事处
 * 
 * @author JIANG
 *
 */
public class Org {

}
